U1_CHANGES = {
    {
        time = "2013年03月21日 08:25",
        ["Archy"] = {
            [=[更新]=],
        },
        ["AtlasLoot_Loader"] = {
            [=[更新]=],
        },
        ["Bagnon"] = {
            [=[更新]=],
        },
    },
    {
        time = "2013年03月13日 17:15",
        ["DBM-Core"] = {
            [=[更新]=],
        },
    },
    {
        time = "2013年03月12日 12:21",
        ["!!!163UI!!!"] = {
            [=[更新5.2]=],
        },
    },
    {
        time = "2013年02月01日 13:42",
        ["!!!163UI!!!"] = {
            [=[更新Ace3]=],
        },
        ["DBM-Core"] = {
            [=[更新]=],
        },
    },
    {
        time = "2013年01月29日 16:06",
        ["AtlasLoot"] = {
            [=[更新]=],
        },
        ["DBM-Core"] = {
            [=[更新]=],
        },
        ["tdPack"] = {
            [=[更新]=],
        },
    },
    {
        time = "2013年01月24日 14:59",
        ["!!!163UI!!!"] = {
            [=[改善天赋面板污染情况]=],
        },
        ["DBM-Core"] = {
            [=[更新]=],
        },
    },
    {
        time = "2013年01月21日 11:55",
        ["DBM-Core"] = {
            [=[更新]=],
        },
    },
    {
        time = "2013年01月16日 13:17",
        ["RaidAlerter"] = {
            [=[更新]=],
        },
        ["tdPack"] = {
            [=[更新]=],
        },
    },
    {
        time = "2013年01月15日 16:36",
        ["DBM-Core"] = {
            [=[更新]=],
        },
        ["PetJournalEnhanced"] = {
            [=[更新]=],
        },
        ["tdPack"] = {
            [=[替换JPack]=],
        },
    },
    {
        time = "2013年01月08日 13:44",
        ["DBM-Core"] = {
            [=[更新]=],
        },
        ["LibBabble-3.0"] = {
            [=[更新]=],
        },
        ["PetJournalEnhanced"] = {
            [=[更新]=],
        },
    },
    {
        time = "2013年01月03日 16:14",
        ["AuctionLite"] = {
            [=[更新 v1.8.9]=],
        },
        ["CocolateBar"] = {
            [=[更新v2.3.3]=],
        },
        ["DBM-Core"] = {
            [=[更新1.2 (更新日志详见 http://bbs.ngacn.cc/read.php?tid=5397726 )]=],
        },
        ["PetJournalEnhanced"] = {
            [=[更新 2.6.1]=],
        },
    },
    {
        time = "2012年12月27日 14:46",
        ["DBM-Core"] = {
            [=[更新]=],
        },
        ["Decursive"] = {
            [=[更新2.7.2.4]=],
        },
    },
    {
        time = "2012年12月25日 10:27",
        ["Archy"] = {
            [=[更新]=],
        },
        ["DBM-Core"] = {
            [=[更新]=],
        },
        ["DuowanChat"] = {
            [=[修正属性通报]=],
        },
    },
    {
        time = "2012年12月21日 15:25",
        ["DBM-Core"] = {
            [=[更新]=],
        },
    },
    {
        time = "2012年12月20日 13:31",
        ["!!!163UI!!!"] = {
            [=[修正部分报错]=],
        },
    },
    {
        time = "2012年12月19日 18:52",
        ["DBM-Core"] = {
            [=[更新]=],
        },
    },
    {
        time = "2012年12月18日 20:32",
        ["!!!163UI!!!"] = {
            [=[　去掉兼容4.x代码，提高第三方插件的兼容性(部分老插件出现错误请到论坛反馈)]=],
        },
    },
    {
        time = "2012年12月18日 15:06",
        ["tdCooldown2"] = {
            [=[修正因为中心冷却导致客户端卡死]=],
        },
    },
    {
        time = "2012年12月17日 12:32",
        ["DBM-Core"] = {
            [=[更新]=],
        },
        ["EventAlertMod"] = {
            [=[更新]=],
        },
    },
    {
        time = "2012年12月14日 13:13",
        ["ReforgeLite"] = {
            [=[更新1.21]=],
        },
    },
    {
        time = "2012年12月13日 18:47",
        ["Broker_Currency"] = {
            [=[更新]=],
        },
    },
    {
        time = "2012年12月11日 17:41",
        ["DBM-Core"] = {
            [=[更新]=],
        },
    },
    {
        time = "2012年12月11日 17:27",
        ["ErrorFilter"] = {
            [=[更新]=],
        },
        ["ReforgeLite"] = {
            [=[更新1.20 (修复物品等级升级)]=],
        },
    },
    {
        time = "2012年12月10日 16:36",
        ["Bagnon"] = {
            [=[更新5.1.1]=],
        },
        ["CoolLine"] = {
            [=[分离成独立插件]=],
        },
        ["DBM-Core"] = {
            [=[更新12.7]=],
        },
        ["Dominos"] = {
            [=[更新5.1.1]=],
        },
        ["Ellipsis"] = {
            [=[法术计时]=],
        },
        ["EventAlertMod"] = {
            [=[更新5.1.0.08a]=],
        },
        ["Gladius"] = {
            [=[更新]=],
        },
        ["PetJournalEnhanced"] = {
            [=[更新翻译]=],
        },
    },
    {
        time = "2012年12月07日 16:57",
        ["EventAlertMod"] = {
            [=[更新5.1.0.07]=],
        },
        ["PetJournalEnhanced"] = {
            [=[更新2.6.0]=],
        },
    },
    {
        time = "2012年12月06日 18:09",
        ["DBM-Core"] = {
            [=[更新12.6]=],
        },
        ["EventAlertMod"] = {
            [=[关闭斩杀]=],
        },
    },
    {
        time = "2012年12月05日 15:26",
        ["163UI_Buff"] = {
            [=[加宽剩余时间]=],
        },
        ["EventAlertMod"] = {
            [=[更新5.1.0.06]=],
        },
    },
    {
        time = "2012年12月04日 19:50",
        ["AtlasLootReverse"] = {
            [=[更新数据]=],
        },
        ["TeamStats"] = {
            [=[更新数据]=],
        },
    },
    {
        time = "2012年12月04日 11:08",
        ["AtlasLoot"] = {
            [=[更新]=],
        },
        ["AuctionLite"] = {
            [=[更新]=],
        },
        ["DBM-Core"] = {
            [=[更新]=],
        },
        ["RangeDisplay"] = {
            [=[更新]=],
        },
        ["LibStatLogic-1.2"] = {
            [=[更新]=],
        },
        ["PetJournalEnhanced"] = {
            [=[更新]=],
        },
        ["163UI_Quest"] = {
            [=[不会在商人面板开着的时候使用触发任务的物品导致其被卖掉]=],
        },
    },
    {
        time = "2012年11月29日 18:41",
        ["Bagnon"] = {
            [=[更新]=],
        },
        ["Decursive"] = {
            [=[更新2.7.2.3]=],
        },
        ["Grid"] = {
            [=[更新部分模块]=],
        },
        ["PetJournalEnhanced"] = {
            [=[更新]=],
        },
        ["TradeskillInfo"] = {
            [=[更新]=],
        },
    },
}
