--[=[
	Language Localization: zhTW
	Translated by: name <email address>
]=]

if GetLocale() ~= "zhTW" then return end
local L = JPackLocale

L.TYPE_BAG = "容器"
L.TYPE_FISHWEAPON = "魚竿"
L.TYPE_MISC = "雜項"
L.TYPE_CONSUMABLE = "消耗品"

JPACK_ORDER = { 
"旅店老闆的女兒","爐石","銅棒","符文銅棒","符文銀棒","符文金棒","符文真銀棒","符文奧金棒","符文魔鐵棒","符文精金棒","符文恆金棒","符文源質棒","礦工鋤","珠寶製作工具","#武器##魚竿","抗惡劣天候釣魚帽","凹損的鏟子","生鏽的灑水壺","古董殺蟲劑","辛多雷寶珠", 
-- 
"#武器##單手斧","#武器##雙手斧","#武器##弓","#武器##槍械","#武器##單手錘","#武器##雙手錘","#武器##長柄武器","#武器##單手劍","#武器##雙手劍","#武器##法杖","#武器##拳套","#武器##雜項","#武器##匕首","#武器##投擲武器","#武器##弩","#武器##魔杖", 
-- 
"#護甲##雜項","#護甲##布甲","#護甲##皮甲","#護甲##鎖甲","#護甲##鎧甲","#護甲##盾牌","#護甲##聖物", 
-- 
"#配方##附魔","#配方##裁縫","#配方##書籍","#配方##製皮","#配方##工程學","#配方##鍛造","#配方##烹飪","#配方##煉金術","#配方##急救","#配方##釣魚","#配方##珠寶設計","#配方##銘文", 
-- 
"#珠寶##紅色","#珠寶##藍色","#珠寶##黃色","#珠寶##紫色","#珠寶##綠色","#珠寶##橘色","#珠寶##變換","#珠寶##簡單","#珠寶##稜彩","#珠寶##榫輪", 
-- 
"#消耗品##精鍊藥劑","#消耗品##藥劑","#消耗品##藥水","#消耗品##食物和飲料","#消耗品##繃帶","#消耗品##物品附魔","#消耗品##捲軸","#消耗品##消耗品","#消耗品##其他", 
-- 
"#商品##元素材料","#商品##布料","#商品##皮革","#商品##金屬與石頭","#商品##烹飪","#商品##草藥","#商品##附魔","#商品##珠寶設計","#商品##零件","#商品##裝置","#商品##爆裂物","#商品##原料","#商品##物品附魔","#商品##其他", 
-- 
"#雕文##法師","#雕文##戰士","#雕文##聖騎士","#雕文##獵人","#雕文##盜賊","#雕文##牧師","#雕文##死亡騎士","#雕文##薩滿","#雕文##術士","#雕文##德魯伊", 
-- 
"#容器##容器","#容器##草藥包","#容器##附魔包","#容器##工程包","#容器##寶石包","#容器##礦石包","#容器##制皮包","#容器##銘文包","#容器##工具箱", 
-- 
"#戰寵","#雜項##寵物夥伴","#雜項##坐騎","#雜項##節慶用品","#雜項##施法材料","#雜項##其他", 
-- 
"#任務","##任務", 
-- 
"##垃圾" 
} 
JPACK_DEPOSIT = { 
"旅店老闆的女兒","爐石","銅棒","符文銅棒","符文銀棒","符文金棒","符文真銀棒","符文奧金棒","符文魔鐵棒","符文精金棒","符文恆金棒","符文源質棒","礦工鋤","珠寶製作工具","#武器##魚竿","抗惡劣天候釣魚帽","凹損的鏟子","生鏽的灑水壺","古董殺蟲劑","辛多雷寶珠", 
-- 
"#武器##單手斧","#武器##雙手斧","#武器##弓","#武器##槍械","#武器##單手錘","#武器##雙手錘","#武器##長柄武器","#武器##單手劍","#武器##雙手劍","#武器##法杖","#武器##拳套","#武器##雜項","#武器##匕首","#武器##投擲武器","#武器##弩","#武器##魔杖", 
-- 
"#護甲##雜項","#護甲##布甲","#護甲##皮甲","#護甲##鎖甲","#護甲##鎧甲","#護甲##盾牌","#護甲##聖物", 
-- 
"#配方##附魔","#配方##裁縫","#配方##書籍","#配方##製皮","#配方##工程學","#配方##鍛造","#配方##烹飪","#配方##煉金術","#配方##急救","#配方##釣魚","#配方##珠寶設計","#配方##銘文", 
-- 
"#珠寶##紅色","#珠寶##藍色","#珠寶##黃色","#珠寶##紫色","#珠寶##綠色","#珠寶##橘色","#珠寶##變換","#珠寶##簡單","#珠寶##稜彩","#珠寶##榫輪", 
-- 
"#消耗品##精鍊藥劑","#消耗品##藥劑","#消耗品##藥水","#消耗品##食物和飲料","#消耗品##繃帶","#消耗品##物品附魔","#消耗品##捲軸","#消耗品##消耗品","#消耗品##其他", 
-- 
"#商品##元素材料","#商品##布料","#商品##皮革","#商品##金屬與石頭","#商品##烹飪","#商品##草藥","#商品##附魔","#商品##珠寶設計","#商品##零件","#商品##裝置","#商品##爆裂物","#商品##原料","#商品##物品附魔","#商品##其他", 
-- 
"#雕文##法師","#雕文##戰士","#雕文##聖騎士","#雕文##獵人","#雕文##盜賊","#雕文##牧師","#雕文##死亡騎士","#雕文##薩滿","#雕文##術士","#雕文##德魯伊", 
-- 
"#容器##容器","#容器##草藥包","#容器##附魔包","#容器##工程包","#容器##寶石包","#容器##礦石包","#容器##制皮包","#容器##銘文包","#容器##工具箱", 
-- 
"#戰寵","#雜項##寵物夥伴","#雜項##坐騎","#雜項##節慶用品","#雜項##施法材料","#雜項##其他", 
-- 
"#任務","##任務", 
-- 
"##垃圾" 
} 
JPACK_DRAW = { 
"旅店老闆的女兒","爐石","銅棒","符文銅棒","符文銀棒","符文金棒","符文真銀棒","符文奧金棒","符文魔鐵棒","符文精金棒","符文恆金棒","符文源質棒","礦工鋤","珠寶製作工具","#武器##魚竿","抗惡劣天候釣魚帽","凹損的鏟子","生鏽的灑水壺","古董殺蟲劑","辛多雷寶珠", 
-- 
"#武器##單手斧","#武器##雙手斧","#武器##弓","#武器##槍械","#武器##單手錘","#武器##雙手錘","#武器##長柄武器","#武器##單手劍","#武器##雙手劍","#武器##法杖","#武器##拳套","#武器##雜項","#武器##匕首","#武器##投擲武器","#武器##弩","#武器##魔杖", 
-- 
"#護甲##雜項","#護甲##布甲","#護甲##皮甲","#護甲##鎖甲","#護甲##鎧甲","#護甲##盾牌","#護甲##聖物", 
-- 
"#配方##附魔","#配方##裁縫","#配方##書籍","#配方##製皮","#配方##工程學","#配方##鍛造","#配方##烹飪","#配方##煉金術","#配方##急救","#配方##釣魚","#配方##珠寶設計","#配方##銘文", 
-- 
"#珠寶##紅色","#珠寶##藍色","#珠寶##黃色","#珠寶##紫色","#珠寶##綠色","#珠寶##橘色","#珠寶##變換","#珠寶##簡單","#珠寶##稜彩","#珠寶##榫輪", 
-- 
"#消耗品##精鍊藥劑","#消耗品##藥劑","#消耗品##藥水","#消耗品##食物和飲料","#消耗品##繃帶","#消耗品##物品附魔","#消耗品##捲軸","#消耗品##消耗品","#消耗品##其他", 
-- 
"#商品##元素材料","#商品##布料","#商品##皮革","#商品##金屬與石頭","#商品##烹飪","#商品##草藥","#商品##附魔","#商品##珠寶設計","#商品##零件","#商品##裝置","#商品##爆裂物","#商品##原料","#商品##物品附魔","#商品##其他", 
-- 
"#雕文##法師","#雕文##戰士","#雕文##聖騎士","#雕文##獵人","#雕文##盜賊","#雕文##牧師","#雕文##死亡騎士","#雕文##薩滿","#雕文##術士","#雕文##德魯伊", 
-- 
"#容器##容器","#容器##草藥包","#容器##附魔包","#容器##工程包","#容器##寶石包","#容器##礦石包","#容器##制皮包","#容器##銘文包","#容器##工具箱", 
-- 
"#戰寵","#雜項##寵物夥伴","#雜項##坐騎","#雜項##節慶用品","#雜項##施法材料","#雜項##其他", 
-- 
"#任務","##任務", 
-- 
"##垃圾" 
}

L["HELP"] = '輸入"/jpack help"獲取幫助.'
L["COMPLETE"] = "整理完畢..."
L["WARN"] = "請先拿掉你鼠標上的物品. 整理時不要抓起物品、金錢、法術."
L["Unknown command"] = "未知指令"

-- Help info
L["Slash command"] = "命令"
L["Pack"] = "整理"
L["Set sequence to ascend"] = "正序整理"
L["Set sequence to descend"] = "逆序整理"
L["Save to the bank"] = "保存到銀行"
L["Load from the bank"] = "從銀行取出"
L["Packup guildbank"] = "整理公會銀行"
L["Print help info"] = "顯示幫助"

L["Sequence"] = "整理順序"
L["asc"] = "正序"
L["desc"] = "逆序"

L["Click"] = "點擊"
L["Pack"] = "整理"

L["Alt + Left-Click"] = "Alt + 左鍵"
L["Shift + Left-Click"] = "Shift + 左鍵"
L["Ctrl + Left-Click"] = "Ctrl + 左鍵"
L["Shift + Right-Click"] = "Shift + 右鍵"
L["Ctrl + Right-Click"] = "Ctrl + 右鍵"

