BuildEnv(...)

ACTIVITY_CUSTOM_NAMES = {
    [1] = '要塞日常',
    [2] = '要塞入侵',
    [3] = '坐骑',
    [4] = '埃匹希斯碎片',
    [5] = '同职业战场',
    [6] = '同职业副本',
    [7] = '寻求帮助',
    [8] = '直播',
    [9] = '任务升级',
    [10] = '副本升级',
}

ACTIVITY_MODE_NAMES = {
    [1] = '开荒',
    [2] = '带新',
    [3] = '成就',
    [4] = '幻化',
    [5] = '冲分',
    [6] = '混分',
    [7] = '荣誉',
    [8] = '练习',
    [9] = '任务',
    [10] = '日常',
    [11] = '练级',
    [12] = '娱乐',
    [99] = '其它',
    [255] = '未知',
}

ACTIVITY_LOOT_NAMES = {
    [1] = '自由',
    [2] = '轮流',
    [3] = '队长',
    [4] = '队伍',
    [5] = '需求',
    [6] = '个人',
    [255] = '未知',
}

ACTIVITY_CUSTOM_DATA = {
    [16] = {
        [1] = 1,
        [2] = 2,
        [3] = 3,
        [4] = 4,
        [5] = 6,
        [6] = 7,
        [7] = 8,
        [8] = 9,
        [9] = 10,
    },
    [17] = {
        [1] = 5,
    },
}

ACTIVITY_MODE_MENUTABLES = {
    [1] = {
        [1] = {
            ['text'] = '任务',
            ['value'] = 9,
        },
    },
    [2] = {
        [1] = {
            ['text'] = '开荒',
            ['value'] = 1,
        },
        [2] = {
            ['text'] = '成就',
            ['value'] = 3,
        },
        [3] = {
            ['text'] = '日常',
            ['value'] = 10,
        },
    },
    [3] = {
        [1] = {
            ['text'] = '开荒',
            ['value'] = 1,
        },
        [2] = {
            ['text'] = '带新',
            ['value'] = 2,
        },
        [3] = {
            ['text'] = '成就',
            ['value'] = 3,
        },
        [4] = {
            ['text'] = '幻化',
            ['value'] = 4,
        },
    },
    [4] = {
        [1] = {
            ['text'] = '冲分',
            ['value'] = 5,
        },
        [2] = {
            ['text'] = '混分',
            ['value'] = 6,
        },
        [3] = {
            ['text'] = '娱乐',
            ['value'] = 12,
        },
    },
    [5] = {
        [1] = {
            ['text'] = '成就',
            ['value'] = 3,
        },
        [2] = {
            ['text'] = '娱乐',
            ['value'] = 12,
        },
    },
    [6] = {
        [1] = {
            ['text'] = '任务',
            ['value'] = 9,
        },
        [2] = {
            ['text'] = '练级',
            ['value'] = 11,
        },
        [3] = {
            ['text'] = '娱乐',
            ['value'] = 12,
        },
        [4] = {
            ['text'] = '其它',
            ['value'] = 99,
        },
    },
    [7] = {
        [1] = {
            ['text'] = '荣誉',
            ['value'] = 7,
        },
        [2] = {
            ['text'] = '练习',
            ['value'] = 8,
        },
        [3] = {
            ['text'] = '娱乐',
            ['value'] = 12,
        },
    },
    [8] = {
        [1] = {
            ['text'] = '荣誉',
            ['value'] = 7,
        },
        [2] = {
            ['text'] = '娱乐',
            ['value'] = 12,
        },
    },
    [9] = {
        [1] = {
            ['text'] = '冲分',
            ['value'] = 5,
        },
        [2] = {
            ['text'] = '混分',
            ['value'] = 6,
        },
        [3] = {
            ['text'] = '娱乐',
            ['value'] = 12,
        },
    },
    [10] = {
        [1] = {
            ['text'] = '荣誉',
            ['value'] = 7,
        },
        [2] = {
            ['text'] = '日常',
            ['value'] = 10,
        },
        [3] = {
            ['text'] = '娱乐',
            ['value'] = 12,
        },
        [4] = {
            ['text'] = '其它',
            ['value'] = 99,
        },
    },
}

ACTIVITY_LOOT_MENUTABLE = {
    [1] = {
        ['text'] = '自由拾取',
        ['value'] = 1,
    },
    [2] = {
        ['text'] = '轮流拾取',
        ['value'] = 2,
    },
    [3] = {
        ['text'] = '队长分配',
        ['value'] = 3,
    },
    [4] = {
        ['text'] = '队伍分配',
        ['value'] = 4,
    },
    [5] = {
        ['text'] = '需求优先',
        ['value'] = 5,
    },
    [6] = {
        ['text'] = '个人拾取',
        ['value'] = 6,
    },
}

ACTIVITY_LOOT_MENUTABLE_WITHALL = {
    [1] = {
        ['text'] = '全部',
        ['value'] = 0,
    },
    [2] = {
        ['text'] = '自由拾取',
        ['value'] = 1,
    },
    [3] = {
        ['text'] = '轮流拾取',
        ['value'] = 2,
    },
    [4] = {
        ['text'] = '队长分配',
        ['value'] = 3,
    },
    [5] = {
        ['text'] = '队伍分配',
        ['value'] = 4,
    },
    [6] = {
        ['text'] = '需求优先',
        ['value'] = 5,
    },
    [7] = {
        ['text'] = '个人拾取',
        ['value'] = 6,
    },
    [8] = {
        ['text'] = '未知',
        ['value'] = 255,
    },
}